programming/color-transparency.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Applying color transparencies</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">

</head>
<body>
<div id="content" class="content">
<h1 class="title">Applying color transparencies</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfaf785f">1. The problem</a>
<ul>
<li><a href="#org9926930">1.1. Explicit transparencies</a></li>
<li><a href="#orgbe397e0">1.2. Implicit transparencies</a></li>
</ul>
</li>
<li><a href="#orgb9c46dd">2. Scheme implementation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfaf785f" class="outline-2">
<h2 id="orgfaf785f"><span class="section-number-2">1.</span> The problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Assume we have some RGB colors along with their transparencies, and we want to
merge them together into a final RGB color, just like it would be displayed on a
screen.
</p>

<p>
There are a few ways of accomplishing this depending on the inputs and the kind
of transparency we want to apply. I chose two kinds of transparencies that I
called <i>implicit</i> and <i>explicit</i>.
</p>
</div>

<div id="outline-container-org9926930" class="outline-3">
<h3 id="org9926930"><span class="section-number-3">1.1.</span> Explicit transparencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let&rsquo;s start with a simple example. We are given two RGB colors, and its
transparencies. We also know that the transparencies add up to 1. We can simply
multiply each R, G and B value by its transparency, and we add them together.
</p>

<p>
\[
f(C_1, t_1, C_2, t_2) = C_1 \times t_1 + C_2 \times t_2
\]
</p>

<p>
Where \(C_n\) represents an RGB color, and \(t_n\) represents its transparency. The
result of the multiplication would be an RGB color whose components would have
been multiplied by the transparency.
</p>

<p>
Since the transparencies add up to 1, this formula is valid for more than two
colors:
</p>

<p>
\[
f(C_1, t_1, \dots, C_n, t_n) = \sum_{i=1}^{n} C_i \times t_i
\]
</p>
</div>
</div>

<div id="outline-container-orgbe397e0" class="outline-3">
<h3 id="orgbe397e0"><span class="section-number-3">1.2.</span> Implicit transparencies</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now let&rsquo;s imagine that the transparencies don&rsquo;t add up to 1. Instead, each
transparency indicates the opacity of the color relative to the previous
color. For example, if we want to &ldquo;overlap&rdquo; a color \(C_2\) with transparency 0.7
on top of an opaque color \(C_1\) (with transparency 1), then each component of
the final color should have 30% of \(C_1\) and 70% of \(C_2\). The formula for this
calculation would be the following:
</p>

<p>
\[
f(C_1, C_2, t_2) = C_1 \times (1 - t_2) + C_2 \times t_2
\]
</p>

<p>
This always assumes that the first color is opaque. This makes sense, since a
color with transparency smaller than one has to be &ldquo;on top&rdquo; of something, even
if it&rsquo;s a black or white background.
</p>

<p>
This formula can be used for more than two colors, but note that this formula is
<b>not</b> associative, meaning the order of the colors or &ldquo;layers&rdquo; matters. I am
honestly not sure how to represent this formula using mathematical notation, but
feel free to <a href="https://github.com/8dcc/8dcc.github.io">contribute</a> to this page.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb9c46dd" class="outline-2">
<h2 id="orgb9c46dd"><span class="section-number-2">2.</span> Scheme implementation</h2>
<div class="outline-text-2" id="text-2">
<p>
These functions can be used to calculate both explicit and implicit
transparencies according to my previous definitions.
</p>

<p>
First, auxiliary functions for adding and scaling RGB colors.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #2fafff;">(</span><span style="color: #4ae2ff;">rgb-add</span> a b<span style="color: #2fafff;">)</span>
  <span style="color: #2fafff;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #cabf00;">(</span>null? b<span style="color: #cabf00;">)</span>
      a
      <span style="color: #cabf00;">(</span>list <span style="color: #44bc44;">(</span>+ <span style="color: #ff5f59;">(</span>car   a<span style="color: #ff5f59;">)</span> <span style="color: #ff5f59;">(</span>car   b<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span>
            <span style="color: #44bc44;">(</span>+ <span style="color: #ff5f59;">(</span>cadr  a<span style="color: #ff5f59;">)</span> <span style="color: #ff5f59;">(</span>cadr  b<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span>
            <span style="color: #44bc44;">(</span>+ <span style="color: #ff5f59;">(</span>caddr a<span style="color: #ff5f59;">)</span> <span style="color: #ff5f59;">(</span>caddr b<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>

<span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #2fafff;">(</span><span style="color: #4ae2ff;">rgb-scale</span> rgb scale<span style="color: #2fafff;">)</span>
  <span style="color: #2fafff;">(</span>list <span style="color: #cabf00;">(</span>* scale <span style="color: #44bc44;">(</span>car   rgb<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
        <span style="color: #cabf00;">(</span>* scale <span style="color: #44bc44;">(</span>cadr  rgb<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
        <span style="color: #cabf00;">(</span>* scale <span style="color: #44bc44;">(</span>caddr rgb<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
The following function takes a list of colors and their respective
transparencies and returns a solid RGB color. Assumes all transparencies add up
to 1.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #2fafff;">(</span><span style="color: #4ae2ff;">transparencies-explicit</span> colors transparencies<span style="color: #2fafff;">)</span>
  <span style="color: #2fafff;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">or</span> <span style="color: #44bc44;">(</span>null? colors<span style="color: #44bc44;">)</span>
          <span style="color: #44bc44;">(</span>null? transparencies<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
      '<span style="color: #cabf00;">()</span>
      <span style="color: #cabf00;">(</span>rgb-add <span style="color: #44bc44;">(</span>rgb-scale <span style="color: #ff5f59;">(</span>car colors<span style="color: #ff5f59;">)</span> <span style="color: #ff5f59;">(</span>car transparencies<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span>
               <span style="color: #44bc44;">(</span>transparencies-explicit <span style="color: #ff5f59;">(</span>cdr colors<span style="color: #ff5f59;">)</span> <span style="color: #ff5f59;">(</span>cdr transparencies<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
Here&rsquo;s an example on how to use it.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #989898;">;; </span><span style="color: #989898;">(196 170 99)</span>
<span style="color: #ff5f59;">(</span>transparencies-explicit '<span style="color: #2fafff;">(</span><span style="color: #cabf00;">(</span><span style="color: #88ca9f;">255</span> <span style="color: #88ca9f;">110</span> <span style="color: #88ca9f;">66</span><span style="color: #cabf00;">)</span> <span style="color: #cabf00;">(</span><span style="color: #88ca9f;">232</span> <span style="color: #88ca9f;">218</span> <span style="color: #88ca9f;">178</span><span style="color: #cabf00;">)</span> <span style="color: #cabf00;">(</span><span style="color: #88ca9f;">75</span> <span style="color: #88ca9f;">238</span> <span style="color: #88ca9f;">104</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span>
                         '<span style="color: #2fafff;">(</span><span style="color: #88ca9f;">0.5</span> <span style="color: #88ca9f;">0.2</span> <span style="color: #88ca9f;">0.3</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
The following function takes a list of colors and their respective
transparencies, but assumes they are <i>implicit</i>. The first transparency is
ignored, and is assumed to be one.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #2fafff;">(</span><span style="color: #4ae2ff;">transparencies-implicit</span> colors transparencies<span style="color: #2fafff;">)</span>
  <span style="color: #2fafff;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #cabf00;">(</span><span style="color: #4ae2ff;">apply-transparency</span> c1 c2 t2<span style="color: #cabf00;">)</span>
    <span style="color: #cabf00;">(</span>rgb-add <span style="color: #44bc44;">(</span>rgb-scale c1 <span style="color: #ff5f59;">(</span>- <span style="color: #88ca9f;">1</span> t2<span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span>
             <span style="color: #44bc44;">(</span>rgb-scale c2 t2<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span>

  <span style="color: #2fafff;">(</span><span style="color: #ff6f9f;">define</span> <span style="color: #cabf00;">(</span><span style="color: #4ae2ff;">transparencies-implicit-reversed</span> colors transparencies<span style="color: #cabf00;">)</span>
    <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">or</span> <span style="color: #ff5f59;">(</span>null? <span style="color: #2fafff;">(</span>cdr colors<span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span>
        <span style="color: #44bc44;">(</span>car colors<span style="color: #44bc44;">)</span>
        <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">let</span> <span style="color: #ff5f59;">(</span><span style="color: #2fafff;">(</span>cur-transparency <span style="color: #cabf00;">(</span>car transparencies<span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
          <span style="color: #ff5f59;">(</span>rgb-add <span style="color: #2fafff;">(</span>rgb-scale <span style="color: #cabf00;">(</span>car colors<span style="color: #cabf00;">)</span>
                              cur-transparency<span style="color: #2fafff;">)</span>
                   <span style="color: #2fafff;">(</span>rgb-scale <span style="color: #cabf00;">(</span>transparencies-implicit-reversed <span style="color: #44bc44;">(</span>cdr colors<span style="color: #44bc44;">)</span> <span style="color: #44bc44;">(</span>cdr transparencies<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
                              <span style="color: #cabf00;">(</span>- <span style="color: #88ca9f;">1</span> cur-transparency<span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span>

  <span style="color: #2fafff;">(</span>transparencies-implicit-reversed <span style="color: #cabf00;">(</span>reverse colors<span style="color: #cabf00;">)</span>
                                    <span style="color: #cabf00;">(</span>reverse transparencies<span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
Since the formula is not associative, we can&rsquo;t just use tail recursion on the
original input. We reverse both <code>colors</code> and <code>transparencies</code> lists, and call an
internal <code>transparencies-implicit-reversed</code> function that is able to call itself
recursively with the rest of the input, effectively iterating from the end to
the start of the lists.
</p>

<p>
Here&rsquo;s an example on how to use it.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #989898;">;; </span><span style="color: #989898;">(161 190 101)</span>
<span style="color: #ff5f59;">(</span>transparencies-implicit '<span style="color: #2fafff;">(</span><span style="color: #cabf00;">(</span><span style="color: #88ca9f;">255</span> <span style="color: #88ca9f;">110</span> <span style="color: #88ca9f;">66</span><span style="color: #cabf00;">)</span> <span style="color: #cabf00;">(</span><span style="color: #88ca9f;">232</span> <span style="color: #88ca9f;">218</span> <span style="color: #88ca9f;">178</span><span style="color: #cabf00;">)</span> <span style="color: #cabf00;">(</span><span style="color: #88ca9f;">75</span> <span style="color: #88ca9f;">238</span> <span style="color: #88ca9f;">104</span><span style="color: #cabf00;">)</span><span style="color: #2fafff;">)</span>
                         '<span style="color: #2fafff;">(</span><span style="color: #88ca9f;">1</span> <span style="color: #88ca9f;">0.3</span> <span style="color: #88ca9f;">0.5</span><span style="color: #2fafff;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
